OpenROAD 26Q2-2145-gf14631c6f5 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 12 thread(s).
source /OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
[INFO ODB-0227] LEF file: /OpenROAD-flow-scripts/flow/platforms/asap7/lef/asap7_tech_1x_201209.lef, created 30 layers, 9 vias
[INFO ODB-0227] LEF file: /OpenROAD-flow-scripts/flow/platforms/asap7/lef/asap7sc7p5t_28_R_1x_220121a.lef, created 212 library cells
link_design top
read_sdc ./results/asap7/tiny_npu_600/base/1_2_yosys.sdc
source /OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
eliminate_dead_logic
Removed 0 unused instances and 0 unused nets.
Design area 537 um^2 100% utilization.
write_db ./results/asap7/tiny_npu_600/base/1_synth.odb
write_sdc -no_timestamp ./results/asap7/tiny_npu_600/base/1_synth.sdc
Elapsed time: 0:01.29[h:]min:sec. CPU time: user 1.22 sys 0.06 (99%). Peak memory: 208520KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
1_synth                   .odb            1            203 e1abf7e299ad2f70056a
1_synth                   .sdc                             64a9847e88830f359bc4
