OpenROAD 26Q2-2145-gf14631c6f5 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 12 thread(s).
source /OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
read_db ./results/asap7/tiny_npu_500/base/2_2_floorplan_macro.odb
read_sdc ./results/asap7/tiny_npu_500/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
Tap and End Cap cell insertion
  TAP Cell          : TAPCELL_ASAP7_75t_R
  ENDCAP Cell       : TAPCELL_ASAP7_75t_R
  Halo Around Macro : 2 2
  TAP Cell Distance : 25
[INFO TAP-0004] Inserted 7256 endcaps.
[INFO TAP-0005] Inserted 70785 tapcells.
Design area 2853 um^2 0% utilization.
write_db ./results/asap7/tiny_npu_500/base/2_3_floorplan_tapcell.odb
Elapsed time: 0:01.41[h:]min:sec. CPU time: user 1.32 sys 0.09 (99%). Peak memory: 244504KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
2_3_floorplan_tapcell     .odb            1            238 b56f1a510b9c24e090ab
