OpenROAD 26Q2-2145-gf14631c6f5 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 12 thread(s).
source /OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
read_db ./results/asap7/rv12_700/base/2_3_floorplan_tapcell.odb
read_sdc ./results/asap7/rv12_700/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
[INFO PDN-0001] Inserting grid: top
Design area 10145 um^2 26% utilization.
write_db ./results/asap7/rv12_700/base/2_4_floorplan_pdn.odb
Elapsed time: 0:02.58[h:]min:sec. CPU time: user 2.46 sys 0.12 (100%). Peak memory: 341164KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
2_4_floorplan_pdn         .odb            2            333 f7eed03c7e80b9a696fb
