OpenROAD 26Q2-2145-gf14631c6f5 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 12 thread(s).
source /OpenROAD-flow-scripts/flow/platforms/asap7/liberty_suppressions.tcl
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_AO_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_INVBUF_RVT_FF_nldm_220122.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_OA_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SIMPLE_RVT_FF_nldm_211120.lib.gz
read_liberty /OpenROAD-flow-scripts/flow/platforms/asap7/lib/NLDM/asap7sc7p5t_SEQ_RVT_FF_nldm_220123.lib
read_db ./results/asap7/rv12_500/base/2_1_floorplan.odb
read_sdc ./results/asap7/rv12_500/base/2_1_floorplan.sdc
source /OpenROAD-flow-scripts/flow/platforms/asap7/setRC.tcl
No macros found: Skipping macro_placement
Design area 10029 um^2 26% utilization.
write_db ./results/asap7/rv12_500/base/2_2_floorplan_macro.odb
Elapsed time: 0:01.60[h:]min:sec. CPU time: user 1.47 sys 0.14 (100%). Peak memory: 324040KB.
Log                       Ext     Elapsed/s Peak Memory/MB sha1sum result [0:20)
2_2_floorplan_macro       .odb            1            316 b344a1c0340e648c2332
